*** Test the API

#+begin_src shell :exports both :results output
  curl \
      -s \
      'http://localhost:8080/v1/graphql' \
      -H 'x-database-role: hasurauser_1' \
      --data '{"query":"query MyQuery {account_aggregate {aggregate {count}}}","variables":{}}' | jq -r '.'
#+end_src

#+RESULTS:
: {
:   "data": {
:     "account_aggregate": {
:       "aggregate": {
:         "count": 249
:       }
:     }
:   }
: }

#+begin_src shell :exports both :results output
  curl \
      -s \
      'http://localhost:8080/v1/graphql' \
      -H 'x-database-role: hasurauser_2' \
      --data '{"query":"query MyQuery {account_aggregate {aggregate {count}}}","variables":{}}' | jq -r '.'
#+end_src

#+RESULTS:
: {
:   "data": {
:     "account_aggregate": {
:       "aggregate": {
:         "count": 249
:       }
:     }
:   }
: }

#+begin_src shell :exports both :results output
  curl \
      -s \
      'http://localhost:8080/v1/graphql' \
      -H 'x-database-role: hasurauser_3' \
      --data '{"query":"query MyQuery {account_aggregate {aggregate {count}}}","variables":{}}' | jq -r '.'
#+end_src

#+RESULTS:
: {
:   "data": {
:     "account_aggregate": {
:       "aggregate": {
:         "count": 245
:       }
:     }
:   }
: }

#+begin_src shell :exports both :results output
  curl \
      -s \
      'http://localhost:8080/v1/graphql' \
      -H 'x-database-role: hasurauser_4' \
      --data '{"query":"query MyQuery {account_aggregate {aggregate {count}}}","variables":{}}' | jq -r '.'
#+end_src

#+RESULTS:
: {
:   "data": {
:     "account_aggregate": {
:       "aggregate": {
:         "count": 257
:       }
:     }
:   }
: }

#+begin_src shell :exports both :results output
  curl \
      -s \
      'http://localhost:8080/v1/graphql' \
      -H 'x-database-role: hasurauser_5' \
      --data '{"query":"query MyQuery {account_aggregate {aggregate {count}}}","variables":{}}' | jq -r '.'
#+end_src

#+RESULTS:
: {
:   "data": {
:     "account_aggregate": {
:       "aggregate": {
:         "count": 0
:       }
:     }
:   }
: }
